In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from pathlib import Path

%matplotlib inline

DATA_DIR = Path("../outputs")
CLEAN_FILE = DATA_DIR / "cleaned_sales_data.csv"

CLEAN_FILE

PosixPath('../outputs/cleaned_sales_data.csv')

In [2]:
df = pd.read_csv(CLEAN_FILE)
df.head()

,order_id,order_date,customer_id,customer_name,city,state,country,product_id,product_name,category,...,discount,payment_method,order_status,gross_amount,discount_amount,net_amount,order_year,order_month,order_month_name,order_day
0,1001,2023-01-05,C001,John Smith,Bangalore,Karnataka,India,P101,Wireless Mouse,Electronics,...,0.10,Upi,Delivered,1598,159.80,1438.20,2023,1,Jan,5
1,1002,2023-01-06,C002,Anita Rao,Hyderabad,Telangana,India,P102,Laptop Sleeve,Electronics,...,0.00,Credit Card,Delivered,1299,0.00,1299.00,2023,1,Jan,6
2,1003,2023-01-07,C003,Rahul Verma,Mumbai,Maharashtra,India,P103,Running Shoes,Fashion,...,0.15,Debit Card,Returned,2499,374.85,2124.15,2023,1,Jan,7

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 23 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          3 non-null      int64
 1   order_date        3 non-null      object
 2   customer_id       3 non-null      object
 3   customer_name     3 non-null      object
 4   city              3 non-null      object
 5   state             3 non-null      object
 6   country           3 non-null      object
 7   product_id        3 non-null      object
 8   product_name      3 non-null      object
 9   category          3 non-null      object
 10  sub_category      3 non-null      object
 11  unit_price        3 non-null      int64
 12  quantity          3 non-null      int64
 13  discount          3 non-null      float64
 14  payment_method    3 non-null      object
 15  order_status      3 non-null      object
 16  gross_amount      3 non-null      int64
 17  discount_amount   3 non-null      float64
 18  net_amount        3 non-null      float64
 19  order_year        3 non-null      int64
 20  order_month       3 non-null      int64
 21  order_month_name  3 non-null      object
 22  order_day         3 non-null      int64
dtypes: float64(3), int64(7), object(13)
memory usage: 684.0+ bytes

In [4]:
df.isna().sum()

order_id            0
order_date          0
customer_id         0
customer_name       0
city                0
state               0
country             0
product_id          0
product_name        0
category            0
sub_category        0
unit_price          0
quantity            0
discount            0
payment_method      0
order_status        0
gross_amount        0
discount_amount     0
net_amount          0
order_year          0
order_month         0
order_month_name    0
order_day           0
dtype: int64

In [5]:
total_orders = df["order_id"].nunique()
total_customers = df["customer_id"].nunique()
total_revenue = df["net_amount"].sum()

total_orders, total_customers, total_revenue

(3, 3, np.float64(4861.35))

In [6]:
city_sales = (
    df.groupby("city", as_index=False)["net_amount"]
      .sum()
      .sort_values("net_amount", ascending=False)
)

city_sales

        city  net_amount
2     Mumbai     2124.15
0  Bangalore     1438.20
1  Hyderabad     1299.00

In [7]:
category_sales = (
    df.groupby("category", as_index=False)["net_amount"]
      .sum()
      .sort_values("net_amount", ascending=False)
)

category_sales

      category  net_amount
0  Electronics     2737.20
1      Fashion     2124.15

In [8]:
payment_sales = (
    df.groupby("payment_method", as_index=False)["net_amount"]
      .sum()
      .sort_values("net_amount", ascending=False)
)

payment_sales

  payment_method  net_amount
1     Debit Card     2124.15
2            Upi     1438.20
0    Credit Card     1299.00

In [9]:
df["order_date"] = pd.to_datetime(df["order_date"], errors="coerce")
df["order_month_year"] = df["order_date"].dt.to_period("M").astype(str)

monthly_sales = (
    df.groupby("order_month_year", as_index=False)["net_amount"]
      .sum()
      .sort_values("order_month_year")
)

monthly_sales

  order_month_year  net_amount
0          2023-01     4861.35